import pytz
from datetime import datetime


classSchedule = {
    813499516: [
        ["", "数学", "物理", "语文", "", "生物", "体育", "", "", "化学", "英语", "", "地理", "", "自习", "", "", "", ""],
        ["", "语文", "化学", "物理", "", "英语", "数学", "", "", "生物", "政治", "", "历史", "", "自习", "", "", "", ""],
        ["", "语文", "英语", "数学", "", "化学", "数学", "", "", "物理", "地理", "", "自习", "", "自习", "", "", "", ""],
        ["", "物理", "生物", "体育", "", "英语", "语文", "", "", "数学", "化学", "", "体活", "", "自习", "", "", "", ""],
        ["", "化学", "英语", "语文", "", "生物", "物理", "", "", "数学", "历史", "", "自习", "", "自习", "", "", "", ""],
        ["早读7:00~7:30",  "第一节7:30~8:10", "第二节8:20~9:00", "第三节9:10~9:50",
         "间操9:50~10:20", "第四节10:20~11:00", "第五节11:05~11:45", "午休11:45~12:30",
         "午睡12:30~13:05", "第六节13:10~13:50", "第七节14:00~I4:40", "眼操14:40~14:45",
         "第八节14:50~15:30", "跑操15:30~15:50", "第九节15:50~16:30", "课后一段16:40~17:20",
         "晚餐17:20~18:00", "课后二段18:00~18:40", "课后三段(师讲)18:50~20:20", "学生自主学习(创新班、住宿生)20:30~21:50"]
        ],
    117854373: [
        ["", "数学", "物理", "语文", "", "生物", "体育", "", "", "化学", "英语", "", "地理", "", "自习", "", "", "", ""],
        ["", "语文", "化学", "物理", "", "英语", "数学", "", "", "生物", "政治", "", "历史", "", "自习", "", "", "", ""],
        ["", "语文", "英语", "数学", "", "化学", "数学", "", "", "物理", "地理", "", "自习", "", "自习", "", "", "", ""],
        ["", "物理", "生物", "体育", "", "英语", "语文", "", "", "数学", "化学", "", "体活", "", "自习", "", "", "", ""],
        ["", "化学", "英语", "语文", "", "生物", "物理", "", "", "数学", "历史", "", "自习", "", "自习", "", "", "", ""],
        ["早读7:00~7:30",  "第一节7:30~8:10", "第二节8:20~9:00", "第三节9:10~9:50",
         "间操9:50~10:20", "第四节10:20~11:00", "第五节11:05~11:45", "午休11:45~12:30",
         "午睡12:30~13:05", "第六节13:10~13:50", "第七节14:00~I4:40", "眼操14:40~14:45",
         "第八节14:50~15:30", "跑操15:30~15:50", "第九节15:50~16:30", "课后一段16:40~17:20",
         "晚餐17:20~18:00", "课后二段18:00~18:40", "课后三段(师讲)18:50~20:20", "学生自主学习(创新班、住宿生)20:30~21:50"]
        ],
    332020665: [
        ["", "英语", "语文", "", "化学", "数学", "体育", "", "", "生物", "历史", "", "美术，音乐，心理", "", "物理", "自习", "", "", "", ""],
        ["", "数学", "化学", "", "物理", "政治", "语文", "", "", "体育", "英语", "", "自习", "", "自习", "", "", "", ""],
        ["", "英语", "生物", "", "物理", "数学", "数学", "", "", "体育", "地理", "", "语文", "", "体活", "", "", "", ""],
        ["", "物理", "英语", "", "语文", "数学", "化学", "", "", "生物", "信息", "", "自习", "", "自习", "", "", "", ""],
        ["", "化学", "物理", "", "英语", "外教", "语文", "", "", "数学", "政治", "", "自习", "", "自习", "", "", "", ""],
        ["早读7:00~7:30",  "第一节7:30~8:10", "第二节8:20~9:00", "第三节9:10~9:50",
         "间操9:50~10:20", "第四节10:20~11:00", "第五节11:05~11:45", "午休11:45~12:30",
         "午睡12:30~13:05", "第六节13:10~13:50", "第七节14:00~I4:40", "眼操14:40~14:45",
         "第八节14:50~15:30", "跑操15:30~15:50", "第九节15:50~16:30", "课后一段16:40~17:20",
         "晚餐17:20~18:00", "课后二段18:00~18:40", "课后三段(师讲)18:50~20:20", "学生自主学习(创新班、住宿生)20:30~21:50"]
]

}


UpperDays = ["一", "二", "三", "四", "五", "六", "日"]


def get_schedule(user_id):
    if classSchedule.get(user_id) is None:
        return f"{user_id}未添加课程表信息，请联系813499516添加自己的课程表即可享用服务"
    now = datetime.now(pytz.timezone('Asia/Shanghai'))
    weekday = now.weekday()
    str_schedule = f"\n今天是{now.month}月{now.day}日星期{UpperDays[now.weekday()]}"
    for classIt, timeIt in zip(classSchedule[user_id][weekday], classSchedule[user_id][5]):
        str_schedule += f"\n{timeIt}:{classIt}"
    return str_schedule


def get_full_schedule(user_id):
    if classSchedule.get(user_id) is None:
        return f"{user_id}未添加课程表信息，请联系813499516添加自己的课程表即可享用服务"
    str_schedule = ""
    for i in range(5):
        str_schedule += '\n'+UpperDays[i]+' '
        for j in range(18):
            if classSchedule[user_id][i][j] is not None:
                str_schedule += classSchedule[user_id][i][j][:1]
    return str_schedule
